import React from 'react';
import './SankeyDiagram.css';
import { Chart } from 'react-google-charts';

/**
 * Google Charts - Sankey Diagrams
 * https://developers.google.com/chart/interactive/docs/gallery/sankey
 */
const options = {
  width: 1000,
  height: 600,
  sankey: {
    node: {
      label: { fontSize: '20px', bold: true },
      colors: ['#4D1C86', '#EE6E2F', '#7DB100', '#008DB1'],
      nodePadding: 30
    }
  }
};

const data = [
  ['From', 'To', '금액'],
  // Project -> 기부사
  // ['시각장애 점자 문해력 향상 프로젝트', 'SK하이닉스', 5506000],

  // 기부사 -> 솔루션사
  ['SK하이닉스', 'HIMS', 1300000],
  ['SK하이닉스', '네오엑세스', 400000],
  ['SK하이닉스', '도서출판점자', 501000],
  ['SK하이닉스', '어니스트비전', 1060000],
  ['SK하이닉스', '오버플로우', 825000],
  ['SK하이닉스', '오파테크', 510000],
  ['SK하이닉스', '한국점자도서관', 910000],

  // 솔루션사 -> 대상자
  ['HIMS', '김민*', 650000],
  ['HIMS', '박중*', 650000],
  ['네오엑세스', '김민*', 40000],
  ['네오엑세스', '박중*', 40000],
  ['네오엑세스', '정경*', 40000],
  ['네오엑세스', '유재*', 40000],
  ['네오엑세스', '신형*', 40000],
  ['네오엑세스', '문수*', 40000],
  ['네오엑세스', '김다*', 40000],
  ['네오엑세스', '공지*', 40000],
  ['네오엑세스', '김명*', 40000],
  ['네오엑세스', '홀길*', 40000],
  ['도서출판점자', '김다*', 41000],
  ['도서출판점자', '공지*', 41000],
  ['도서출판점자', '김명*', 41000],
  ['도서출판점자', '홀길*', 41000],
  ['도서출판점자', '정경*', 41000],
  ['도서출판점자', '유재*', 41000],
  ['도서출판점자', '김민*', 35000],
  ['도서출판점자', '정경*', 35000],
  ['도서출판점자', '유재*', 35000],
  ['도서출판점자', '김다*', 35000],
  ['도서출판점자', '공지*', 35000],
  ['도서출판점자', '신형*', 40000],
  ['도서출판점자', '박중*', 40000],
  ['어니스트비전', '문수*', 530000],
  ['어니스트비전', '홀길*', 530000],
  ['오버플로우', '정경*', 165000],
  ['오버플로우', '유재*', 165000],
  ['오버플로우', '신형*', 165000],
  ['오버플로우', '김다*', 165000],
  ['오버플로우', '공지*', 165000],
  ['오파테크', '김민*', 100000],
  ['오파테크', '박중*', 100000],
  ['오파테크', '정경*', 100000],
  ['오파테크', '문수*', 105000],
  ['오파테크', '홀길*', 105000],
  ['한국점자도서관', '김민*', 91000],
  ['한국점자도서관', '박중*', 91000],
  ['한국점자도서관', '정경*', 91000],
  ['한국점자도서관', '유재*', 91000],
  ['한국점자도서관', '신형*', 91000],
  ['한국점자도서관', '문수*', 91000],
  ['한국점자도서관', '김다*', 91000],
  ['한국점자도서관', '공지*', 91000],
  ['한국점자도서관', '김명*', 91000],
  ['한국점자도서관', '홀길*', 91000]
];

const SankeyDiagram = () => {
  return (
    <div>
      <Chart
        chartType="Sankey"
        data={data}
        options={options}
        width="1000"
        height="600"
        legendToggle
      />
    </div>
  );
};

export default SankeyDiagram;
